# Options
cask_args appdir: '~/Applications', require_sha: true

#############################################################
# Command Line                                              #
#############################################################

# CLI Essentials
brew 'git'          # Version controll
brew 'tmux'         # Term multiplexer

# CLI Basics
# brew 'fzf'          # Fuzzy file finder and filtering
brew 'jq'           # JSON parser, output and query files
brew 'ripgrep'      # Searching within files (better grep)
brew 'tlrc'         # Community-maintained docs (better man)
brew 'tree'         # Directory listings as tree structure
brew 'trash-cli'    # Record and restore removed files
brew 'unzip'        # Unzip
brew 'watch'        # Run commands periorically
brew 'zoxide'       # Auto-learning navigation (better cd)
brew 'starship'     # Prompt

# CASKS
cask 'postman'        # HTTP API testing app 
cask 'docker-desktop'
cask 'visual-studio-code' # Code editor
cask 'kitty'              # GPU Accelerated Terminal Emulator
cask 'karabiner-elements' # Karabiner Elements
cask 'intellij-idea'      # Code editpr for java
cask 'pycharm'            # Code editor py, ipynb
cask 'sublime-text'       # Text editor, will migrate off this soon
cask 'zotero'             # Paper/Citations manager
cask 'claude-code'

# Development Langs, Compilers, Package Managers and SDKs
brew 'jenv'
brew 'openjdk@17'
brew 'openjdk@21'
brew 'rustup'
brew 'uv'
brew 'node'
# TODO fix other language configurations later

# DevOps
brew 'container'         # Containers
brew 'nmap'           # Port scanning
cask 'wireshark'      # Network analyzer + packet capture       # Cryptography and SSL/TLS Toolkit
brew 'openssl'    

# Media
cask 'spotify', args: { require_sha: false } # Propietary music streaming
cask 'iina'          # Media player
cask 'signal'         # Link to encrypted mobile messenger
cask 'discord'        # Discord
cask 'whatsapp'       # Luddite messenger
cask 'protonvpn'      # Client app for ProtonVPN
cask 'mattermost'     # University communication

# Browsers
cask "firefox@developer-edition"

# Fonts
cask 'font-fantasque-sans-mono-nerd-font'

# Mac OS Mods and Imrovments
cask 'stats'          # System resource usage in menubar
cask 'aldente'        # Battery manager

